In [35]:
import math as m
binNumber = 10001
dec=0
for j,i in enumerate(str(binNumber)):
    dec = dec + int(i)*m.pow(2,j)
    
print(int(dec))

17

# DataFrame

In [72]:
import pandas as pd
import numpy as np
state = ["Ohio","Ohio","Ohio","Nevada","Nevada","Nevada"]
data = {"state":state,"year":[2000,2001,2002,2003,2004,2005],"pop":[1.5,1.7,3.6,2.4,2.9,3.2]}
data['debt']=['a','b','c','d','e','f']
frame2 = pd.DataFrame(data,columns=['year','state','pop','debt'],index=['one','two','three','four','five','six'])
print(frame2.head())
frame2['debt'] = np.arange(len(frame2))
frame2.head()

       year   state  pop debt
one    2000    Ohio  1.5    a
two    2001    Ohio  1.7    b
three  2002    Ohio  3.6    c
four   2003  Nevada  2.4    d
five   2004  Nevada  2.9    e

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2003  Nevada  2.4     3
five   2004  Nevada  2.9     4

In [58]:
val = pd.Series(['a','b','c','d','e','f'],index=['one','two','three','four','five','six'])
lst = val.values
lst

array(['a', 'b', 'c', 'd', 'e', 'f'], dtype=object)

In [75]:
obj3 = pd.Series(['blue','purple','yellow'],index=[0,3,6])
print(obj3)
obj3 = obj3.reindex(range(9))
obj3

0      blue
3    purple
6    yellow
dtype: object

0      blue
1       NaN
2       NaN
3    purple
4       NaN
5       NaN
6    yellow
7       NaN
8       NaN
dtype: object

In [80]:
obj3 = pd.Series(['blue','purple','yellow'],index=[0,3,6])
print(obj3)
obj3 = obj3.reindex(range(9),method='ffill') #multiple method to fill the missing values while straching
obj3

0      blue
3    purple
6    yellow
dtype: object

0      blue
1      blue
2      blue
3    purple
4    purple
5    purple
6    yellow
7    yellow
8    yellow
dtype: object

In [82]:
import numpy as np
import pandas as pd
states = pd.DataFrame(np.arange(9).reshape((3,3)),index=['a','c','d'],columns=['Ohio','Texas','California'])
print(states)
states = states.reindex(['a','b','c','d'])
print(states)

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8
   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [83]:
import numpy as np
import pandas as pd
states = pd.DataFrame(np.arange(9).reshape((3,3)),index=['a','c','d'],columns=['Ohio','Texas','California'])
print(states)
states = states.reindex(['a','b','c','d'],method="ffill")
print(states)

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8
   Ohio  Texas  California
a     0      1           2
b     0      1           2
c     3      4           5
d     6      7           8

In [102]:
import numpy as np
import pandas as pd
states = pd.DataFrame(np.arange(9).reshape((3,3)),index=['a','c','d'],columns=['Ohio','Texas','California'])
print(states)
state_name = ['Texas','Utah','California','Ohio']
states = states.reindex(columns=state_name).ffill(axis="columns")
print(states)

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8
   Texas  Utah  California  Ohio
a    1.0   1.0         2.0   0.0
c    4.0   4.0         5.0   3.0
d    7.0   7.0         8.0   6.0

# Deleting Data ( row or columns from dataframe)

In [113]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),index=["Ohio","Colorado","Utah","New York"],columns=["one","two","three","four"])
data
data.drop(["Ohio","Utah"])
data
data.drop("two",axis=1,inplace=True)
data

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [114]:
df2 = data["three"]>5
df2

Ohio        False
Colorado     True
Utah         True
New York     True
Name: three, dtype: bool

In [122]:
data[data["four"]>10]

          one  three  four
Utah        8     10    11
New York   12     14    15

In [125]:
(data["four"]>10 && data["four"]<100)

SyntaxError: invalid syntax (<ipython-input-125-c144fe8ac097>, line 1)

# Selection with loc and iloc

In [144]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),index=["Ohio","Colorado","Utah","New York"],columns=["one","two","three","four"])
print(data.loc[['Colorado'],['two','three']])
print(data.iloc[:])
data.iloc[[2],[3,0,2]]
data.iloc[:]
data.iloc[:,:3]
data.iloc[:2]

          two  three
Colorado    5      6
          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [150]:
data.loc[:,['two','three']]

          two  three
Ohio        1      2
Colorado    5      6
Utah        9     10
New York   13     14

# Arithmetic and Data Alignment

In [151]:
print(list('bcd'))

['b', 'c', 'd']

In [166]:
df1 = pd.DataFrame(np.arange(9.).reshape((3,3)),columns=list('bcd'),index=['Ohio','Texas','Colorado'])
print(df1)
df2 = pd.DataFrame(np.arange(12).reshape([4,3]),columns=list('bde'),index=['Ohio','Utah','Texas','Oregon'])
print(df2)

df3 = df1 + df2
df3

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0
        b   d   e
Ohio    0   1   2
Utah    3   4   5
Texas   6   7   8
Oregon  9  10  11

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      0.0 NaN   3.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN